/* App */
"app.title" = "ScriptMate (Alpha)";

/* Settings Sheet */
"settings.title" = "AI Service Settings";
"settings.apiKeyLabel" = "API Key:";
"settings.endpointLabel" = "Endpoint URL:";
"settings.endpointPlaceholder" = "https://api.example.com/v1";
"settings.testConnection" = "Test Connection";
"settings.modelLabel" = "Model:";
"settings.cancel" = "Cancel";
"settings.save" = "Save";
"settings.show" = "Show";
"settings.hide" = "Hide";

/* Detection */
"detection.detected" = "✓ Detected: %@";
"detection.unknown" = "? Unknown input format";
"detection.fetching" = "✓ Detected: %@ — Fetching models...";
"detection.modelsFound" = "✓ Detected: %@ — %lu model(s) found";

/* Chat */
"chat.inputPlaceholder" = "Type a message...";
"chat.notConfigured" = "Please configure AI settings first.";
"chat.feedbackSent" = "[Execution result sent to AI]";

/* Mode Toggle */
"mode.chat" = "Chat";
"mode.console" = "Console";
"mode.window" = "Window";
"mode.autoFixProgress" = "[Auto-fix %lu/%lu]";

/* Tool Use */
"tool.executing" = "[Executing tool: %@]";
"tool.codePanelUpdated" = "Code panel updated";
"tool.unknownTool" = "unknown";
"tool.result" = "result";
"tool.chatModeBlocked" = "Operation not permitted in Chat mode (read-only)";

/* Context Stats Bar */
"stats.tokens" = "%1$@ %2$@ / %3$@";
"stats.tokens.noLimit" = "%@ tokens";
"stats.autoFix" = "Fix %lu/%lu";

/* Provider Display Names */
"provider.anthropic" = "Anthropic";
"provider.openai" = "OpenAI";
"provider.grok" = "Grok";
"provider.gemini" = "Gemini";
"provider.ollama" = "Ollama";
"provider.lmStudio" = "LM Studio";
"provider.jan" = "Jan";
"provider.openaiCompatible" = "OpenAI Compatible Endpoint";
"provider.customEndpoint" = "Custom Endpoint";
"provider.aiService" = "AI Service";
"provider.unknown" = "Unknown";

/* Export */
"export.success" = "Exported to: %@";
"export.fileExists.title" = "File Already Exists";
"export.fileExists.message" = "\"%@\" already exists. Do you want to replace it?";
"export.fileExists.replace" = "Replace";
"export.fileExists.cancel" = "Cancel";
"export.menuTitleRequired.title" = "Menu Title Required";
"export.menuTitleRequired.message" = "Add a # MenuTitle: line to the beginning of your script.";
"export.error.title" = "Export Failed";
"export.error.message" = "Could not export script: %@";

/* Import */
"import.error.title" = "Import Failed";
"import.error.readFailed" = "Could not read file: %@";
"import.success" = "Imported: %@";

/* Settings — Scripts Path */
"settings.scriptsPathLabel" = "Scripts Folder:";
"settings.scriptsPathDefault" = "Default (…/Glyphs 3/Scripts/ScriptMate/)";
"settings.scriptsPathBrowse" = "Browse…";
"settings.scriptsPathReset" = "Reset to Default";

/* Settings Window */
"settings.tab.general" = "General";
"settings.tab.aiService" = "AI Service";
"settings.general.scriptsFolder" = "Scripts Folder:";
"settings.general.browse" = "Browse…";
"settings.general.resetDefault" = "Reset to Default";
"settings.general.defaultPath" = "Default (…/Glyphs 3/Scripts/ScriptMate/)";
"settings.general.choose" = "Choose";
"settings.general.language" = "Chat Language:";
"settings.general.webSearch" = "Forum Search (Glyphs Forum)";
"settings.general.maxToolIterations" = "Max Auto-Fix Iterations:";
"settings.general.maxToolIterations.manual" = "Write only";
"settings.general.promptTier" = "Prompt Optimization:";
"settings.general.promptTier.auto" = "Auto (Recommended)";
"settings.general.promptTier.full" = "Full — Large models";
"settings.general.promptTier.standard" = "Standard — Medium models";
"settings.general.promptTier.compact" = "Compact — Small local models";
"settings.general.promptTier.hint" = "Auto detects your model's capability. Choose manually if AI skips steps or gives incomplete answers.";
"settings.general.environment" = "Environment";
"settings.general.install" = "Install";
"settings.general.installed" = "Installed";
"settings.openSettings" = "Settings…";

/* Service List Context Menu */
"settings.service.edit" = "Edit…";
"settings.service.delete" = "Delete";

/* Service Editor */
"settings.editor.title" = "Add AI Service";
"settings.editor.type" = "Type:";
"settings.editor.add" = "Add";
"settings.editor.testing" = "Testing connection…";
"settings.editor.connectionFailed" = "Connection failed";
"settings.editor.save" = "Save";
"settings.editor.editTitle" = "Edit Service";

/* ACP Backend */
"settings.backendTypeLabel" = "Backend:";
"settings.backendType.api" = "API";
"settings.backendType.acp" = "ACP Agent";
"settings.agentLabel" = "Agent:";
"settings.agentName.default" = "ACP Agent";
"settings.noAgentsFound" = "No ACP agents found";

/* ACP Toggle */
"settings.acpToggle" = "Show installed ACP agents";

/* Provider / Agent Popup */
"settings.providerLabel" = "Provider:";
"settings.apiKeyOptional" = "Optional";
"settings.customAgent" = "Custom…";
"settings.customAgentLabel" = "Command:";

/* Bottom Toolbar */
"toolbar.run" = "Run";
"toolbar.export" = "Export";
"toolbar.import" = "Import";

/* Tab Bar */
"tab.new" = "New Tab";
"tab.history" = "History";
"tab.close" = "Close Tab";
"tab.closeOthers" = "Close Other Tabs";
"tab.delete" = "Delete Conversation";
"tab.recentConversations" = "Recent Conversations";
"tab.noHistory" = "No conversation history";
"tab.untitled" = "Untitled";

/* Chat UI Status */
"status.responding" = "Responding...";
"status.executingTool" = "Executing %@...";
"status.cancelled" = "Response cancelled.";
"status.noResponse" = "No response received.";

/* Chat Input */
"input.placeholder" = "Type a message...";
"input.aiDisclaimer" = "AI-generated scripts may contain errors. Please review before running.";

/* Toolbar Tooltips */
"toolbar.settings" = "Settings";
"toolbar.webSearch.on" = "Forum Search: On";
"toolbar.webSearch.off" = "Forum Search: Off";
"toolbar.autoFix.on" = "Auto-Fix: On";
"toolbar.autoFix.off" = "Auto-Fix: Off";

/* Edit Code */
"edit_code.invalidParameterType" = "Invalid parameters: start_line and end_line must be numbers";
"edit_code.emptyCode" = "code parameter is empty: replacement code is required";

/* Mode Pill */
"mode.chat.pill" = "Chat";
"mode.console.pill" = "Console";
"mode.window.pill" = "Window";
